Catalogs/ВидыДокументовБИА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыДокументовБИА</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъектаИсточника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСвязи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПечатнойФормыПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПечатнойФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОбъектаМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ОплатаПоСреднемуЗаработкуСписком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОплатаПоСреднемуЗаработкуСписком</Name>
			<Comment>АПК:58 Имя неверно образовано из синонима.</Comment>
			<BasedOn>
				<xr:Item>Document.ОбучениеСотрудниковОхранеТруда</xr:Item>
				<xr:Item>Document.ПроверкаЗнанияТребованийОхраныТруда</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>АПК:58 Имя неверно образовано из синонима.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутрисменноеОтсутствие</Name>
					<Comment>АПК:58 Имя неверно образовано из синонима.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтсутствия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплачиватьЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаПоСреднемуЗаработку</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КомандировкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>КомандировкиСотрудников</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаКомандировку</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбучениеРазвитиеСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейВПути</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоНазначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганизацияНазначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомандировкаЗаСчетСредств</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Командировка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Командировка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ВидыДокументовБИА/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает вид документа, соответствующий переданным значениям реквизитов.
//
// Параметры:
//  ИдентификаторПечатнойФормы - Строка - идентификатор печатной формы, как он задан в командах печати.
//  ИдентификаторОбъектаМетаданных - Справочник.ДополнительныеОтчетыИОбработки, Справочник.ИдентификаторыОбъектовМетаданных.
//
// Возвращаемое значение:
//  СправочникСсылка.ВидыДокументовБИА, Неопределено - найденный элемент.
//
Функция НайтиВидДокумента(ИдентификаторПечатнойФормы, ИдентификаторОбъектаМетаданных) Экспорт 
	
	НайденныйВид = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторОбъектаМетаданных", ИдентификаторОбъектаМетаданных);
	Запрос.УстановитьПараметр("ИдентификаторПечатнойФормы", ИдентификаторПечатнойФормы);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВидыДокументовБИАПечатныеФормы.Ссылка КАК ВидДокументаБИА,
	|	ВидыДокументовБИАПечатныеФормы.ИдентификаторПечатнойФормы КАК ИдентификаторПечатнойФормы
	|ИЗ
	|	Справочник.ВидыДокументовБИА.ПечатныеФормы КАК ВидыДокументовБИАПечатныеФормы
	|ГДЕ
	|	(ВидыДокументовБИАПечатныеФормы.ИдентификаторОбъектаМетаданных = &ИдентификаторОбъектаМетаданных
	|			И ВидыДокументовБИАПечатныеФормы.ИдентификаторПечатнойФормы = &ИдентификаторПечатнойФормы)
	|	И НЕ ВидыДокументовБИАПечатныеФормы.Ссылка.ПометкаУдаления";
	ВидыДокументовБИА = Запрос.Выполнить().Выбрать();
	Если ВидыДокументовБИА.Количество() > 0 Тогда
		ВидыДокументовБИА.Следующий();
		НайденныйВид = ВидыДокументовБИА.ВидДокументаБИА;
	КонецЕсли;
	
	Возврат НайденныйВид;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ОписаниеНастроек = ОписаниеНастроекПоУмолчанию();
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	"Документ.БольничныйЛист");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	"Документ.Командировка");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	"Документ.ОплатаДнейУходаЗаДетьмиИнвалидами");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	"Документ.ОплатаПоСреднемуЗаработку");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	"Документ.Отпуск");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	"Документ.ПростойСотрудников");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	НСтр("ru='Подробный расчет начислений'"),
	"ПодробныйРасчетНачислений",
	"Документ.УвольнениеСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Дополнительное соглашение'"),
	"ПФ_MXL_ДополнительноеСоглашение",
	НСтр("ru='Дополнительное соглашение'"),
	"ПФ_MXL_ДополнительноеСоглашение",
	"Документ.Совмещение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Дополнительное соглашение'"),
	"ПФ_MXL_ДополнительноеСоглашение",
	НСтр("ru='Доп. соглашение к трудовому договору при переводе на дистанционную работу'"),
	"ПФ_MXL_ДопСоглашениеКТрудовомуДоговоруПриПереводеНаДистанционнуюРаботу",
	"Документ.КадровыйПеревод");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Дополнительное соглашение'"),
	"ПФ_MXL_ДополнительноеСоглашение",
	НСтр("ru='Доп. соглашение к трудовому договору при переводе на дистанционную работу'"),
	"ПФ_MXL_ДопСоглашениеКТрудовомуДоговоруПриПереводеНаДистанционнуюРаботу",
	"Документ.КадровыйПереводСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Карточка гражданина, подлежащего воинскому учету'"),
	"ПФ_MXL_КарточкаГражданинаПодлежащегоВоинскомуУчету",
	НСтр("ru='Карточка гражданина, подлежащего воинскому учету'"),
	"ПФ_MXL_КарточкаГражданинаПодлежащегоВоинскомуУчету",
	"Справочник.Сотрудники");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ на совмещение'"),
	"ПФ_MXL_ПриказНаСовмещение",
	НСтр("ru='Приказ на совмещение'"),
	"ПФ_MXL_ПриказНаСовмещение",
	"Документ.Совмещение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ об оплате по среднему заработку'"),
	"ПФ_MXL_ПриказОбОплатеПоСреднемуЗаработку",
	НСтр("ru='Приказ об оплате по среднему заработку'"),
	"ПФ_MXL_ПриказОбОплатеПоСреднемуЗаработку",
	"Документ.ОплатаПоСреднемуЗаработку");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ об оплате по среднему заработку'"),
	"ПФ_MXL_ПриказОбОплатеПоСреднемуЗаработку",
	НСтр("ru='Приказ об оплате по среднему заработку'"),
	"ПФ_MXL_ПриказОбОплатеПоСреднемуЗаработку",
	"Документ.ОплатаПоСреднемуЗаработкуСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ об оплате по среднему заработку'"),
	"ПФ_MXL_ПриказОбОплатеПоСреднемуЗаработку",
	НСтр("ru='Приказ об оплате по среднему заработку списком'"),
	"ПФ_MXL_ПриказОбОплатеПоСреднемуЗаработкуСписком",
	"Документ.ОплатаПоСреднемуЗаработкуСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ об отмене совмещения'"),
	"ПФ_MXL_ПриказОбОтменеСовмещения",
	НСтр("ru='Приказ об отмене совмещения'"),
	"ПФ_MXL_ПриказОбОтменеСовмещения",
	"Документ.ОтменаСовмещения");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ об отстранении от работы'"),
	"ПФ_MXL_ПриказОбОтстраненииОтРаботы",
	НСтр("ru='Приказ об отстранении от работы'"),
	"ПФ_MXL_ПриказОбОтстраненииОтРаботы",
	"Документ.ПростойСотрудников");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о восстановлении на работе'"),
	"ПФ_MXL_ПриказОВосстановленииНаРаботе",
	НСтр("ru='Приказ о восстановлении на работе'"),
	"ПФ_MXL_ПриказОВосстановленииНаРаботе",
	"Документ.ВосстановлениеВДолжности");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о временной приостановке работ (простое)'"),
	"ПФ_MXL_ПриказОВременнойПриостановкеРабот",
	НСтр("ru='Приказ о временной приостановке работ (простое)'"),
	"ПФ_MXL_ПриказОВременнойПриостановкеРабот",
	"Документ.ПростойСотрудников");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о выплате материальной помощи'"),
	"ПФ_MXL_ПриказОВыплатеМатериальнойПомощи",
	НСтр("ru='Приказ о выплате материальной помощи'"),
	"ПФ_MXL_ПриказОВыплатеМатериальнойПомощи",
	"Документ.МатериальнаяПомощь");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о работе на условиях неполного рабочего времени'"),
	"ПФ_MXL_ПриказОВыходеНаНеполноеРабочееВремя",
	НСтр("ru='Приказ о работе на условиях неполного рабочего времени'"),
	"ПФ_MXL_ПриказОВыходеНаНеполноеРабочееВремя",
	"Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о выходе на работу до окончания отпуска по уходу за ребенком'"),
	"ПФ_MXL_ПриказОВыходеНаРаботуИзОтпускаПоУходуЗаРебенком",
	НСтр("ru='Приказ о выходе на работу до окончания отпуска по уходу за ребенком'"),
	"ПФ_MXL_ПриказОВыходеНаРаботуИзОтпускаПоУходуЗаРебенком",
	"Документ.ВозвратИзОтпускаПоУходуЗаРебенком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о предоставлении дней ухода'"),
	"ПФ_MXL_ПриказОПредоставленииДнейУхода",
	НСтр("ru='Приказ о предоставлении дней ухода'"),
	"ПФ_MXL_ПриказОПредоставленииДнейУхода",
	"Документ.ОплатаДнейУходаЗаДетьмиИнвалидами");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о прекращении отпуска в связи с уходом в отпуск по беременности и родам'"),
	"ПФ_MXL_ПриказОПрекращенииОтпускаПоУходуЗаРебенком",
	НСтр("ru='Приказ о прекращении отпуска в связи с уходом в отпуск по беременности и родам'"),
	"ПФ_MXL_ПриказОПрекращенииОтпускаПоУходуЗаРебенком",
	"Документ.ВозвратИзОтпускаПоУходуЗаРебенком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о приостановлении контракта с гражданским служащим'"),
	"ПФ_MXL_ПриостановлениеГражданскиеСлужащиеКонтракт",
	НСтр("ru='Приказ о приостановлении контракта с гражданским служащим в связи с контрактом'"),
	"ПФ_MXL_ПриостановлениеГражданскиеСлужащиеКонтракт",
	"Документ.ПриостановлениеТрудовыхДоговоровКонтрактов");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о приостановлении контракта с гражданским служащим'"),
	"ПФ_MXL_ПриостановлениеГражданскиеСлужащиеКонтракт",
	НСтр("ru='Приказ о приостановлении контракта с гражданским служащим в связи с мобилизацией'"),
	"ПФ_MXL_ПриостановлениеГражданскиеСлужащиеМобилизация",
	"Документ.ПриостановлениеТрудовыхДоговоровКонтрактов");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о приостановлении контракта с гражданским служащим'"),
	"ПФ_MXL_ПриостановлениеГражданскиеСлужащиеКонтракт",
	НСтр("ru='Приказ о приостановлении контракта с гражданским служащим в связи с контрактом о добровольном содействии'"),
	"ПФ_MXL_ПриостановлениеГражданскиеСлужащиеСодействие",
	"Документ.ПриостановлениеТрудовыхДоговоровКонтрактов");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о приостановлении трудового договора'"),
	"ПФ_MXL_ПриостановлениеКонтракт",
	НСтр("ru='Приказ о приостановлении трудового договора в связи с контрактом'"),
	"ПФ_MXL_ПриостановлениеКонтракт",
	"Документ.ПриостановлениеТрудовыхДоговоровКонтрактов");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о приостановлении трудового договора'"),
	"ПФ_MXL_ПриостановлениеКонтракт",
	НСтр("ru='Приказ о приостановлении в связи с мобилизацией'"),
	"ПФ_MXL_ПриостановлениеМобилизация",
	"Документ.ПриостановлениеТрудовыхДоговоровКонтрактов");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о приостановлении трудового договора'"),
	"ПФ_MXL_ПриостановлениеКонтракт",
	НСтр("ru='Приказ о приостановлении трудового договора в связи с контрактом о добровольном содействии'"),
	"ПФ_MXL_ПриостановлениеСодействие",
	"Документ.ПриостановлениеТрудовыхДоговоровКонтрактов");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчет пособия'"),
	"ПФ_MXL_РасчетПособия",
	НСтр("ru='Расчет пособия'"),
	"ПФ_MXL_РасчетПособия",
	"Документ.БольничныйЛист");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Справка о заработке для расчета пособий'"),
	"ПФ_MXL_Справка_2022",
	НСтр("ru='Справка о заработке для расчета пособий'"),
	"ПФ_MXL_Справка_2022",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Справка о заработке для расчета пособий'"),
	"ПФ_MXL_Справка_2022",
	НСтр("ru='Справка о заработке для расчета пособий'"),
	"ПФ_MXL_Справка_2022",
	"Документ.УвольнениеСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Сведения о трудовой деятельности, СТД-Р'"),
	"ПФ_MXL_СТД_Р",
	НСтр("ru='Сведения о трудовой деятельности, СТД-Р'"),
	"ПФ_MXL_СТД_Р",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Сведения о трудовой деятельности, СТД-Р'"),
	"ПФ_MXL_СТД_Р",
	НСтр("ru='Сведения о трудовой деятельности, СТД-Р'"),
	"ПФ_MXL_СТД_Р",
	"Документ.УвольнениеСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о приеме'"),
	"ПФ_MXL_Т1",
	НСтр("ru='Приказ о приеме'"),
	"ПФ_MXL_Т1",
	"Справочник.Сотрудники");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о приеме'"),
	"ПФ_MXL_Т1",
	НСтр("ru='Приказ о приеме (Т-1)'"),
	"ПФ_MXL_Т1",
	"Документ.ПриемНаРаботу");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Командировочное удостоверение (Т-10)'"),
	"ПФ_MXL_Т10",
	НСтр("ru='Командировочное удостоверение (Т-10)'"),
	"ПФ_MXL_Т10",
	"Документ.Командировка");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Служебное задание (Т-10а)'"),
	"ПФ_MXL_Т10а",
	НСтр("ru='Служебное задание (Т-10а)'"),
	"ПФ_MXL_Т10а",
	"Документ.Командировка");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о приеме'"),
	"ПФ_MXL_Т1",
	НСтр("ru='Приказ о приеме (Т-1а)'"),
	"ПФ_MXL_Т1а",
	"Документ.ПриемНаРаботуСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Личная карточка (Т-2)'"),
	"ПФ_MXL_Т2",
	НСтр("ru='Личная карточка (Т-2)'"),
	"ПФ_MXL_Т2",
	"Справочник.Сотрудники");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о переводе'"),
	"ПФ_MXL_Т5",
	НСтр("ru='Приказ о переводе'"),
	"ПФ_MXL_Т5",
	"Справочник.Сотрудники");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о переводе'"),
	"ПФ_MXL_Т5",
	НСтр("ru='Приказ о переводе (Т-5)'"),
	"ПФ_MXL_Т5",
	"Документ.КадровыйПеревод");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о переводе'"),
	"ПФ_MXL_Т5",
	НСтр("ru='Приказ о переводе (Т-5а)'"),
	"ПФ_MXL_Т5а",
	"Документ.КадровыйПереводСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о предоставлении отпуска'"),
	"ПФ_MXL_Т6",
	НСтр("ru='Приказ о предоставлении отпуска (Т-6)'"),
	"ПФ_MXL_Т6",
	"Документ.БольничныйЛист");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о предоставлении отпуска'"),
	"ПФ_MXL_Т6",
	НСтр("ru='Приказ о предоставлении отпуска (Т-6)'"),
	"ПФ_MXL_Т6",
	"Документ.Отпуск");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о предоставлении отпуска'"),
	"ПФ_MXL_Т6",
	НСтр("ru='Приказ о предоставлении отпуска (Т-6)'"),
	"ПФ_MXL_Т6",
	"Документ.ОтпускаСотрудников");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о предоставлении отпуска'"),
	"ПФ_MXL_Т6",
	НСтр("ru='Приказ о предоставлении отпуска (Т-6)'"),
	"ПФ_MXL_Т6",
	"Документ.ОтпускБезСохраненияОплаты");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о предоставлении отпуска'"),
	"ПФ_MXL_Т6",
	НСтр("ru='Приказ о предоставлении отпуска (Т-6)'"),
	"ПФ_MXL_Т6",
	"Документ.ОтпускБезСохраненияОплатыСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о предоставлении отпуска'"),
	"ПФ_MXL_Т6",
	НСтр("ru='Приказ о предоставлении отпуска (Т-6)'"),
	"ПФ_MXL_Т6",
	"Документ.ОтпускПоУходуЗаРебенком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о предоставлении отпуска'"),
	"ПФ_MXL_Т6",
	НСтр("ru='Приказ о предоставлении отпуска работникам (Т-6а)'"),
	"ПФ_MXL_Т6а",
	"Документ.ОтпускаСотрудников");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о предоставлении отпуска'"),
	"ПФ_MXL_Т6",
	НСтр("ru='Приказ о предоставлении отпуска работникам (Т-6а)'"),
	"ПФ_MXL_Т6а",
	"Документ.ОтпускБезСохраненияОплатыСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о предоставлении отпуска'"),
	"ПФ_MXL_Т6",
	НСтр("ru='Приказ о предоставлении отпуска работникам (Т-6а) по видам отпусков'"),
	"ПФ_MXL_Т6а",
	"Документ.ОтпускаСотрудников");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка - расчет о предоставлении отпуска (Т-60)'"),
	"ПФ_MXL_Т60",
	НСтр("ru='Записка - расчет о предоставлении отпуска (Т-60)'"),
	"ПФ_MXL_Т60",
	"Документ.Отпуск");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет при увольнении (Т-61)'"),
	"ПФ_MXL_Т61",
	НСтр("ru='Записка-расчет при увольнении (Т-61)'"),
	"ПФ_MXL_Т61",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет при увольнении (Т-61)'"),
	"ПФ_MXL_Т61",
	НСтр("ru='Записка-расчет при увольнении (Т-61)'"),
	"ПФ_MXL_Т61",
	"Документ.УвольнениеСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ об увольнении'"),
	"ПФ_MXL_Т8",
	НСтр("ru='Приказ об увольнении'"),
	"ПФ_MXL_Т8",
	"Справочник.Сотрудники");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ об увольнении'"),
	"ПФ_MXL_Т8",
	НСтр("ru='Приказ об увольнении (Т-8)'"),
	"ПФ_MXL_Т8",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ об увольнении'"),
	"ПФ_MXL_Т8",
	НСтр("ru='Приказ об увольнении (Т-8а)'"),
	"ПФ_MXL_Т8а",
	"Документ.УвольнениеСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о направлении в командировку'"),
	"ПФ_MXL_Т9",
	НСтр("ru='Приказ о направлении в командировку (Т-9)'"),
	"ПФ_MXL_Т9",
	"Документ.Командировка");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Приказ о направлении в командировку'"),
	"ПФ_MXL_Т9",
	НСтр("ru='Приказ на командировку (Т-9а)'"),
	"ПФ_MXL_Т9а",
	"Документ.КомандировкиСотрудников");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Трудовой договор'"),
	"ПФ_MXL_ТрудовойДоговор",
	НСтр("ru='Трудовой договор'"),
	"ПФ_MXL_ТрудовойДоговор",
	"Документ.ПриемНаРаботу");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Трудовой договор'"),
	"ПФ_MXL_ТрудовойДоговор",
	НСтр("ru='Трудовые договоры'"),
	"ПФ_MXL_ТрудовойДоговор",
	"Документ.ПриемНаРаботуСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Трудовой договор'"),
	"ПФ_MXL_ТрудовойДоговор",
	НСтр("ru='Трудовой договор (микропредприятий)'"),
	"ПФ_MXL_ТрудовойДоговорМикропредприятий",
	"Документ.ПриемНаРаботу");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Трудовой договор'"),
	"ПФ_MXL_ТрудовойДоговор",
	НСтр("ru='Трудовой договор (микропредприятий)'"),
	"ПФ_MXL_ТрудовойДоговорМикропредприятий",
	"Документ.ПриемНаРаботуСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Трудовой договор'"),
	"ПФ_MXL_ТрудовойДоговор",
	НСтр("ru='Трудовой договор (микропредприятий)'"),
	"ПФ_MXL_ТрудовойДоговорМикропредприятий",
	"Справочник.Сотрудники");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Трудовой договор'"),
	"ПФ_MXL_ТрудовойДоговор",
	НСтр("ru='Трудовой договор (микропредприятий), без условий оплаты'"),
	"ПФ_MXL_ТрудовойДоговорМикропредприятийБезДоступаКЗарплате",
	"Документ.ПриемНаРаботу");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Трудовой договор'"),
	"ПФ_MXL_ТрудовойДоговор",
	НСтр("ru='Трудовой договор (микропредприятий), без условий оплаты'"),
	"ПФ_MXL_ТрудовойДоговорМикропредприятийБезДоступаКЗарплате",
	"Документ.ПриемНаРаботуСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Трудовой договор'"),
	"ПФ_MXL_ТрудовойДоговор",
	НСтр("ru='Трудовой договор (микропредприятий), без условий оплаты'"),
	"ПФ_MXL_ТрудовойДоговорМикропредприятийБезДоступаКЗарплате",
	"Справочник.Сотрудники");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Трудовой договор'"),
	"ПФ_MXL_ТрудовойДоговор",
	НСтр("ru='Трудовой договор при дистанционной работе'"),
	"ПФ_MXL_ТрудовойДоговорПриДистанционнойРаботе",
	"Документ.ПриемНаРаботу");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Трудовой договор'"),
	"ПФ_MXL_ТрудовойДоговор",
	НСтр("ru='Трудовые договоры при дистанционной работе'"),
	"ПФ_MXL_ТрудовойДоговорПриДистанционнойРаботе",
	"Документ.ПриемНаРаботуСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Табель учета рабочего времени'"),
	"ПФ_MXL_УнифицированнаяФормаТ13",
	НСтр("ru='Т-13'"),
	"ПФ_MXL_УнифицированнаяФормаТ13",
	"Документ.ТабельУчетаРабочегоВремени");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Подразделы 1.2 и 3 формы ЕФС-1'"),
	"ПФ_MXL_ФормаЕФС_1",
	НСтр("ru='Подразделы 1.2 и 3 формы ЕФС-1'"),
	"ПФ_MXL_ФормаЕФС_1",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Подразделы 1.2 и 3 формы ЕФС-1'"),
	"ПФ_MXL_ФормаЕФС_1",
	НСтр("ru='Подразделы 1.2 и 3 формы ЕФС-1'"),
	"ПФ_MXL_ФормаЕФС_1",
	"Документ.УвольнениеСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Подраздел 1.2 формы ЕФС-1'"),
	"ПФ_MXL_ФормаЕФС_1_1_2",
	НСтр("ru='Подраздел 1.2 формы ЕФС-1'"),
	"ПФ_MXL_ФормаЕФС_1_1_2",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Подраздел 1.2 формы ЕФС-1'"),
	"ПФ_MXL_ФормаЕФС_1_1_2",
	НСтр("ru='Подраздел 1.2 формы ЕФС-1'"),
	"ПФ_MXL_ФормаЕФС_1_1_2",
	"Документ.УвольнениеСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='СЗВ-ДСО'"),
	"ПФ_MXL_ФормаСЗВ_ДСО",
	НСтр("ru='СЗВ-ДСО'"),
	"ПФ_MXL_ФормаСЗВ_ДСО",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='СЗВ-ДСО'"),
	"ПФ_MXL_ФормаСЗВ_ДСО",
	НСтр("ru='СЗВ-ДСО'"),
	"ПФ_MXL_ФормаСЗВ_ДСО",
	"Документ.УвольнениеСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='СЗВ-СТАЖ'"),
	"ПФ_MXL_ФормаСЗВ_СТАЖ",
	НСтр("ru='СЗВ-СТАЖ'"),
	"ПФ_MXL_ФормаСЗВ_СТАЖ",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='СЗВ-СТАЖ'"),
	"ПФ_MXL_ФормаСЗВ_СТАЖ",
	НСтр("ru='СЗВ-СТАЖ'"),
	"ПФ_MXL_ФормаСЗВ_СТАЖ",
	"Документ.УвольнениеСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Раздел 3 РСВ'"),
	"Раздел3РСВ",
	НСтр("ru='Раздел 3 РСВ'"),
	"Раздел3РСВ",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Раздел 3 РСВ'"),
	"Раздел3РСВ",
	НСтр("ru='Раздел 3 РСВ'"),
	"Раздел3РСВ",
	"Документ.УвольнениеСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	"Документ.БольничныйЛист");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	"Документ.Командировка");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	"Документ.ОплатаДнейУходаЗаДетьмиИнвалидами");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	"Документ.ОплатаПоСреднемуЗаработку");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	"Документ.Отпуск");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	"Документ.ОтпускПоУходуЗаРебенком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	"Документ.ПростойСотрудников");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	"Документ.УвольнениеСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	НСтр("ru='Расчет среднего заработка (для выходного пособия)'"),
	"РасчетСреднегоЗаработкаВыходногоПособия",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчет среднего заработка'"),
	"РасчетСреднегоЗаработка",
	НСтр("ru='Расчет среднего заработка (для выходного пособия)'"),
	"РасчетСреднегоЗаработкаВыходногоПособия",
	"Документ.УвольнениеСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Согласие на обработку персональных данных'"),
	"СогласиеНаОбработкуПерсональныхДанных",
	НСтр("ru='Согласие на обработку ПДн...'"),
	"СогласиеНаОбработкуПерсональныхДанных",
	"Справочник.Сотрудники");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Справка по отпускам сотрудника'"),
	"СправкаПоОтпускамСотрудника",
	НСтр("ru='Справка по отпускам сотрудника'"),
	"СправкаПоОтпускамСотрудника",
	"Справочник.Сотрудники");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Табель учета рабочего времени'"),
	"ПФ_MXL_УнифицированнаяФормаТ13",
	НСтр("ru='Табель учета рабочего времени (0504421) до 2015 года'"),
	"УнифицированнаяФорма0504421",
	"Документ.ТабельУчетаРабочегоВремени");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Табель учета рабочего времени'"),
	"ПФ_MXL_УнифицированнаяФормаТ13",
	НСтр("ru='Табель учета рабочего времени (0504421)'"),
	"УнифицированнаяФорма0504421с2015",
	"Документ.ТабельУчетаРабочегоВремени");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Справка о доходах (2-НДФЛ)'"),
	"Форма2НДФЛ",
	НСтр("ru='Справка о доходах (2-НДФЛ)'"),
	"Форма2НДФЛ",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Справка о доходах (2-НДФЛ)'"),
	"Форма2НДФЛ",
	НСтр("ru='Справка о доходах (2-НДФЛ)'"),
	"Форма2НДФЛ",
	"Документ.УвольнениеСписком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='СЗВ-М'"),
	"ФормаСЗВ_М",
	НСтр("ru='СЗВ-М'"),
	"ФормаСЗВ_М",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='СЗВ-М'"),
	"ФормаСЗВ_М",
	НСтр("ru='СЗВ-М'"),
	"ФормаСЗВ_М",
	"Документ.УвольнениеСписком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетная ведомость'"),
	"Т51",
	НСтр("ru='Расчетная ведомость (Т-51)'"),
	"Т51",
	"Отчет.АнализНачисленийИУдержаний");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетная ведомость'"),
	"Т51",
	НСтр("ru='Расчетная ведомость Т-51 (за первую половину месяца)'"),
	"Т51ПерваяПоловинаМесяца",
	"Отчет.АнализНачисленийИУдержанийАвансом");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Регистр налогового учета по НДФЛ'"),
	"РегистрНалоговогоУчетаПоНДФЛ",
	НСтр("ru='Регистр налогового учета по НДФЛ'"),
	"РегистрНалоговогоУчетаПоНДФЛ",
	"Отчет.РегистрНалоговогоУчетаПоНДФЛ");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Карточка-справка (0504417)'"),
	"КарточкаСправка0504417",
	НСтр("ru='Карточка-справка (0504417)'"),
	"КарточкаСправка0504417с2015",
	"Отчет.КарточкаСправка0504417");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Карточка-справка (0504417)'"),
	"КарточкаСправка0504417",
	НСтр("ru='Карточка-справка (0504417) до 2015 года'"),
	"КарточкаСправка0504417",
	"Отчет.КарточкаСправка0504417");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетная ведомость'"),
	"Т51",
	НСтр("ru='Расчетная ведомость (0504402)'"),
	"Форма0504402",
	"Отчет.АнализНачисленийИУдержаний");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетная ведомость'"),
	"Т51",
	НСтр("ru='Расчетная ведомость 0504402 (за первую половину месяца)'"),
	"Форма0504402ПерваяПоловинаМесяца",
	"Отчет.АнализНачисленийИУдержанийАвансом");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Карточка учета страховых взносов'"),
	"КарточкаУчетаПоСтраховымВзносам",
	НСтр("ru='Карточка учета страховых взносов'"),
	"КарточкаУчетаСтраховыхВзносовВЦелом",
	"Отчет.КарточкаУчетаПоСтраховымВзносам");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Карточка учета страховых взносов'"),
	"КарточкаУчетаПоСтраховымВзносам",
	НСтр("ru='Карточка учета страховых взносов (по филиалам)'"),
	"КарточкаУчетаСтраховыхВзносовПоФилиалам",
	"Отчет.КарточкаУчетаПоСтраховымВзносам");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='""Сводная"" справка 2-НДФЛ'"),
	"СводнаяСправка2НДФЛ",
	НСтр("ru='""Сводная"" справка 2-НДФЛ'"),
	"СводнаяСправка2НДФЛ",
	"Отчет.АнализНДФЛДетальный");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='""Сводная"" справка 2-НДФЛ'"),
	"СводнаяСправка2НДФЛ",
	НСтр("ru='""Сводная"" справка 2-НДФЛ'"),
	"СводнаяСправка",
	"Отчет.АнализНДФЛ");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Полный свод начислений, удержаний и выплат'"),
	"ПолныйСводНачисленийУдержанийИВыплат",
	НСтр("ru='Полный свод начислений, удержаний и выплат'"),
	"ПолныйСводНачисленийУдержанийИВыплат",
	"Отчет.АнализНачисленийИУдержаний");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Анализ взносов в фонды'"),
	"АнализВзносовВФонды",
	НСтр("ru='Анализ взносов в фонды'"),
	"АнализВзносовВФонды",
	"Отчет.АнализВзносовВФонды");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Проверка расчета взносов'"),
	"ПроверкаРасчетаВзносов",
	НСтр("ru='Проверка расчета взносов'"),
	"ПроверкаРасчетаВзносов",
	"Отчет.АнализВзносовВФонды");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетный листок'"),
	"РасчетныйЛисток",
	НСтр("ru='Расчетный листок'"),
	"РасчетныйЛисток",
	"Отчет.АнализНачисленийИУдержаний");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетный листок'"),
	"РасчетныйЛисток",
	НСтр("ru='Расчетный листок (за первую половину месяца)'"),
	"РасчетныйЛистокПерваяПоловинаМесяца",
	"Отчет.АнализНачисленийИУдержанийАвансом");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетный листок'"),
	"РасчетныйЛисток",
	НСтр("ru='Расчетный листок с разбивкой по рабочим местам'"),
	"РасчетныйЛистокПоРабочимМестам",
	"Отчет.АнализНачисленийИУдержаний");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='4-ФСС'"),
	"РегламентированныйОтчет4ФСС",
	НСтр("ru='4-ФСС'"),
	"РегламентированныйОтчет4ФСС",
	"Отчет.РегламентированныйОтчет4ФСС");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='РСВ-1 ПФР'"),
	"РегламентированныйОтчетРСВ1",
	НСтр("ru='РСВ-1 ПФР'"),
	"РегламентированныйОтчетРСВ1",
	"Отчет.РегламентированныйОтчетРСВ1");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='РВ-3 ПФР'"),
	"РегламентированныйОтчетРВ3",
	НСтр("ru='РВ-3 ПФР'"),
	"РегламентированныйОтчетРВ3",
	"Отчет.РегламентированныйОтчетРВ3");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='ЕФС-1: Раздел 2'"),
	"РегламентированныйОтчетЕФС1ОСС",
	НСтр("ru='ЕФС-1: Сведения о начисленных страховых взносах на обязательное социальное страхование от несчастных случаев на производстве и профессиональных заболе'"),
	"РегламентированныйОтчетЕФС1ОСС",
	"Отчет.РегламентированныйОтчетЕФС1ОСС");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='ЕФС-1: Подраздел 1.3'"),
	"РегламентированныйОтчетЕФС1СЗПГос",
	НСтр("ru='ЕФС-1: Сведения о заработной плате и условиях осуществления деятельности работников государственных (муниципальных) учреждений'"),
	"РегламентированныйОтчетЕФС1СЗПГос",
	"Отчет.РегламентированныйОтчетЕФС1СЗПГос");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчет по страховым взносам'"),
	"РегламентированныйОтчетРасчетПоСтраховымВзносам",
	НСтр("ru='Расчет по страховым взносам'"),
	"РегламентированныйОтчетРасчетПоСтраховымВзносам",
	"Отчет.РегламентированныйОтчетРасчетПоСтраховымВзносам");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='6-НДФЛ'"),
	"РегламентированныйОтчет6НДФЛ",
	НСтр("ru='6-НДФЛ'"),
	"РегламентированныйОтчет6НДФЛ",
	"Отчет.РегламентированныйОтчет6НДФЛ");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='6-НДФЛ'"),
	"РегламентированныйОтчет6НДФЛ",
	НСтр("ru='6-НДФЛ (с 2021 года)'"),
	"РегламентированныйОтчет6_НДФЛ",
	"Отчет.РегламентированныйОтчет6_НДФЛ");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Форма П-4'"),
	"РегламентированныйОтчетСтатистикаФормаП4",
	НСтр("ru='Форма П-4'"),
	"РегламентированныйОтчетСтатистикаФормаП4",
	"Отчет.РегламентированныйОтчетСтатистикаФормаП4");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Форма П-4 (НЗ)'"),
	"РегламентированныйОтчетСтатистикаФормаП4НЗ",
	НСтр("ru='Форма П-4 (НЗ)'"),
	"РегламентированныйОтчетСтатистикаФормаП4НЗ",
	"Отчет.РегламентированныйОтчетСтатистикаФормаП4НЗ");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Персонифицированные сведения о физических лицах'"),
	"РегламентированныйОтчетПерсонифицированныеСведенияОФизическихЛицах",
	НСтр("ru='Персонифицированные сведения о физических лицах'"),
	"РегламентированныйОтчетПерсонифицированныеСведенияОФизическихЛицах",
	"Отчет.РегламентированныйОтчетПерсонифицированныеСведенияОФизическихЛицах");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Справка для пособия по безработице'"),
	"ПФ_MXL_СправкаОСреднемЗаработке2019",
	НСтр("ru='Справка для пособия по безработице'"),
	"ПФ_MXL_СправкаОСреднемЗаработке2019",
	"Справочник.Сотрудники");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Справка для пособия по безработице'"),
	"ПФ_MXL_СправкаОСреднемЗаработке2019",
	НСтр("ru='Справка для пособия по безработице'"),
	"ПФ_MXL_СправкаОСреднемЗаработке2023",
	"Справочник.Сотрудники");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Карточка учета страховых взносов'"),
	"КарточкаУчетаПоСтраховымВзносам",
	НСтр("ru='Карточка учета страховых взносов'"),
	"КарточкаУчетаПоСтраховымВзносам",
	"Справочник.Сотрудники");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетно-платежная ведомость'"),
	"Т49",
	НСтр("ru='Расчетно-платежная ведомость (Т-49)'"),
	"Т49",
	"Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Платежная ведомость'"),
	"Т53",
	НСтр("ru='Платежная ведомость (Т-53)'"),
	"Т53",
	"Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетно-платежная ведомость'"),
	"Т49",
	НСтр("ru='Расчетно-платежная ведомость (0504401)'"),
	"ПФ_MXL_0504401",
	"Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетно-платежная ведомость'"),
	"Т49",
	НСтр("ru='Расчетно-платежная ведомость (0504401)'"),
	"ПФ_MXL_0504401с2015",
	"Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетная ведомость'"),
	"Т51",
	НСтр("ru='Расчетная ведомость (0504402)'"),
	"ПФ_MXL_0504402",
	"Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Платежная ведомость'"),
	"Т53",
	НСтр("ru='Платежная ведомость (0504403)'"),
	"ПФ_MXL_0504403",
	"Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Платежная ведомость'"),
	"Т53",
	НСтр("ru='Платежная ведомость (0504403)'"),
	"ПФ_MXL_0504403с2015",
	"Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетно-платежная ведомость'"),
	"Т49",
	НСтр("ru='Расчетно-платежная ведомость 13-ФО'"),
	"ПФ_MXL_13ФО",
	"Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетно-платежная ведомость'"),
	"Т49",
	НСтр("ru='Расчетно-платежная ведомость 15-ФО'"),
	"ПФ_MXL_15ФО",
	"Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетно-платежная ведомость'"),
	"Т49",
	НСтр("ru='Расчетно-платежная ведомость 6002501'"),
	"ПФ_MXL_6002501",
	"Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетно-платежная ведомость'"),
	"Т49",
	НСтр("ru='Расчетно-платежная ведомость 6002502'"),
	"ПФ_MXL_6002502",
	"Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Реестр перечисленных сумм НДФЛ'"),
	"ПФ_MXL_РеестрПеречисленныхСумм",
	НСтр("ru='Реестр перечисленных сумм НДФЛ'"),
	"ПФ_MXL_РеестрПеречисленныхСумм",
	"Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425с2015",
	"Документ.ПростойСотрудников");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	"Документ.ПростойСотрудников");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425с2015",
	"Документ.Отпуск");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	"Документ.Отпуск");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425с2015",
	"Документ.ОплатаПоСреднемуЗаработку");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	"Документ.ОплатаПоСреднемуЗаработку");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425с2015",
	"Документ.ОплатаДнейУходаЗаДетьмиИнвалидами");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	"Документ.ОплатаДнейУходаЗаДетьмиИнвалидами");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетная ведомость'"),
	"Т51",
	НСтр("ru='Расчетная ведомость (0504402)'"),
	"ПФ_MXL_0504402",
	"Документ.ВедомостьНаВыплатуЗарплатыПеречислением");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Реестр перечисленных сумм НДФЛ'"),
	"ПФ_MXL_РеестрПеречисленныхСумм",
	НСтр("ru='Реестр перечисленных сумм НДФЛ'"),
	"ПФ_MXL_РеестрПеречисленныхСумм",
	"Документ.ВедомостьНаВыплатуЗарплатыПеречислением");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425с2015",
	"Документ.Увольнение");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	"Документ.Увольнение");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Справка для пособия по безработице'"),
	"ПФ_MXL_СправкаОСреднемЗаработке2019",
	НСтр("ru='Справка для пособия по безработице'"),
	"ПФ_MXL_СправкаОСреднемЗаработке2019",
	"Документ.Увольнение");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Справка для пособия по безработице'"),
	"ПФ_MXL_СправкаОСреднемЗаработке2019",
	НСтр("ru='Справка для пособия по безработице'"),
	"ПФ_MXL_СправкаОСреднемЗаработке2023",
	"Документ.Увольнение");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетная ведомость'"),
	"Т51",
	НСтр("ru='Расчетная ведомость (0504402)'"),
	"ПФ_MXL_0504402",
	"Документ.ВедомостьНаВыплатуЗарплатыВБанк");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Реестр перечисленных сумм НДФЛ'"),
	"ПФ_MXL_РеестрПеречисленныхСумм",
	НСтр("ru='Реестр перечисленных сумм НДФЛ'"),
	"ПФ_MXL_РеестрПеречисленныхСумм",
	"Документ.ВедомостьНаВыплатуЗарплатыВБанк");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425с2015",
	"Документ.Командировка");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	"Документ.Командировка");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425с2015",
	"Документ.УвольнениеСписком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	НСтр("ru='Записка-расчет (0504425)'"),
	"РасчетСреднегоЗаработкаФорма0504425",
	"Документ.УвольнениеСписком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Справка для пособия по безработице'"),
	"ПФ_MXL_СправкаОСреднемЗаработке2019",
	НСтр("ru='Справка для пособия по безработице'"),
	"ПФ_MXL_СправкаОСреднемЗаработке2019",
	"Документ.УвольнениеСписком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Справка для пособия по безработице'"),
	"ПФ_MXL_СправкаОСреднемЗаработке2019",
	НСтр("ru='Справка для пособия по безработице'"),
	"ПФ_MXL_СправкаОСреднемЗаработке2023",
	"Документ.УвольнениеСписком");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетно-платежная ведомость'"),
	"Т49",
	НСтр("ru='Расчетно-платежная ведомость (Т-49)'"),
	"Т49",
	"Документ.ВедомостьНаВыплатуЗарплатыВКассу");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Платежная ведомость'"),
	"Т53",
	НСтр("ru='Платежная ведомость (Т-53)'"),
	"Т53",
	"Документ.ВедомостьНаВыплатуЗарплатыВКассу");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетно-платежная ведомость'"),
	"Т49",
	НСтр("ru='Расчетно-платежная ведомость (0504401)'"),
	"ПФ_MXL_0504401",
	"Документ.ВедомостьНаВыплатуЗарплатыВКассу");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетно-платежная ведомость'"),
	"Т49",
	НСтр("ru='Расчетно-платежная ведомость (0504401)'"),
	"ПФ_MXL_0504401с2015",
	"Документ.ВедомостьНаВыплатуЗарплатыВКассу");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетная ведомость'"),
	"Т51",
	НСтр("ru='Расчетная ведомость (0504402)'"),
	"ПФ_MXL_0504402",
	"Документ.ВедомостьНаВыплатуЗарплатыВКассу");
	
	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Платежная ведомость'"),
	"Т53",
	НСтр("ru='Платежная ведомость (0504403)'"),
	"ПФ_MXL_0504403",
	"Документ.ВедомостьНаВыплатуЗарплатыВКассу");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Платежная ведомость'"),
	"Т53",
	НСтр("ru='Платежная ведомость (0504403)'"),
	"ПФ_MXL_0504403с2015",
	"Документ.ВедомостьНаВыплатуЗарплатыВКассу");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетно-платежная ведомость'"),
	"Т49",
	НСтр("ru='Расчетно-платежная ведомость 13-ФО'"),
	"ПФ_MXL_13ФО",
	"Документ.ВедомостьНаВыплатуЗарплатыВКассу");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетно-платежная ведомость'"),
	"Т49",
	НСтр("ru='Расчетно-платежная ведомость 15-ФО'"),
	"ПФ_MXL_15ФО",
	"Документ.ВедомостьНаВыплатуЗарплатыВКассу");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетно-платежная ведомость'"),
	"Т49",
	НСтр("ru='Расчетно-платежная ведомость 6002501'"),
	"ПФ_MXL_6002501",
	"Документ.ВедомостьНаВыплатуЗарплатыВКассу");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Расчетно-платежная ведомость'"),
	"Т49",
	НСтр("ru='Расчетно-платежная ведомость 6002502'"),
	"ПФ_MXL_6002502",
	"Документ.ВедомостьНаВыплатуЗарплатыВКассу");

	ДобавитьОписаниеНастройки(ОписаниеНастроек,
	НСтр("ru='Реестр перечисленных сумм НДФЛ'"),
	"ПФ_MXL_РеестрПеречисленныхСумм",
	НСтр("ru='Реестр перечисленных сумм НДФЛ'"),
	"ПФ_MXL_РеестрПеречисленныхСумм",
	"Документ.ВедомостьНаВыплатуЗарплатыВКассу");

	ЗаписатьНастройкиПоУмолчанию(ОписаниеНастроек);
	
КонецПроцедуры

Функция ИдентификаторСвязи(НаименованиеВидаДокументов) Экспорт
	Возврат СтрЗаменить(ТРег(НаименованиеВидаДокументов), " ", "");
КонецФункции

Функция ОписаниеНастроекПоУмолчанию()
	ОписаниеНастроек = Новый ТаблицаЗначений;
	ОписаниеНастроек.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	ОписаниеНастроек.Колонки.Добавить("ИдентификаторПечатнойФормыПоУмолчанию", Новый ОписаниеТипов("Строка"));
	ОписаниеНастроек.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	ОписаниеНастроек.Колонки.Добавить("ИдентификаторПечатнойФормы", Новый ОписаниеТипов("Строка"));
	ОписаниеНастроек.Колонки.Добавить("ИдентификаторОбъектаМетаданных", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных"));
	Возврат ОписаниеНастроек;
КонецФункции

Процедура ДобавитьОписаниеНастройки(ОписаниеНастроек, Наименование, ИдентификаторПечатнойФормыПоУмолчанию, Представление, ИдентификаторПечатнойФормы, ПолноеИмяИдентификатораОбъекта)
	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяИдентификатораОбъекта, Ложь);
	Если ЗначениеЗаполнено(ИдентификаторОбъектаМетаданных) Тогда
		НовоеОписаниеНастроек = ОписаниеНастроек.Добавить();
		НовоеОписаниеНастроек.Наименование = Наименование;
		НовоеОписаниеНастроек.Представление = Представление;
		НовоеОписаниеНастроек.ИдентификаторПечатнойФормы = ИдентификаторПечатнойФормы;
		НовоеОписаниеНастроек.ИдентификаторОбъектаМетаданных = ИдентификаторОбъектаМетаданных;
		НовоеОписаниеНастроек.ИдентификаторПечатнойФормыПоУмолчанию = ИдентификаторПечатнойФормыПоУмолчанию;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьНастройкиПоУмолчанию(ОписаниеНастроек)
	
	Для Каждого Настройка Из ОписаниеНастроек Цикл
		
		Если НайтиВидДокумента(Настройка.ИдентификаторПечатнойФормы, Настройка.ИдентификаторОбъектаМетаданных) = Неопределено Тогда
			
			ВидДокументаБИА = НайтиВидДокументаПоИдентификаторуПоУмолчанию(Настройка.ИдентификаторПечатнойФормыПоУмолчанию);
			Если ВидДокументаБИА = Неопределено Тогда
				ВидДокументаБИА = Справочники.ВидыДокументовБИА.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(ВидДокументаБИА, Настройка, "Наименование, ИдентификаторПечатнойФормыПоУмолчанию");
				ВидДокументаБИА.ПометкаУдаления = Ложь;
				ВидДокументаБИА.ИдентификаторСвязи = Справочники.ВидыДокументовБИА.ИдентификаторСвязи(ВидДокументаБИА.Наименование);
			Иначе
				ВидДокументаБИА = ВидДокументаБИА.ПолучитьОбъект();
			КонецЕсли;
			НастройкаВидаДокументаБИА = ВидДокументаБИА.ПечатныеФормы.Добавить();
			ЗаполнитьЗначенияСвойств(НастройкаВидаДокументаБИА, Настройка, "Представление, ИдентификаторПечатнойФормы");
			НастройкаВидаДокументаБИА.ИдентификаторОбъектаМетаданных = Настройка.ИдентификаторОбъектаМетаданных;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ВидДокументаБИА);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиВидДокументаПоИдентификаторуПоУмолчанию(ИдентификаторПечатнойФормыПоУмолчанию)
	
	НайденныйВид = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторПечатнойФормыПоУмолчанию", ИдентификаторПечатнойФормыПоУмолчанию);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВидыДокументовБИА.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыДокументовБИА КАК ВидыДокументовБИА
	|ГДЕ
	|	НЕ ВидыДокументовБИА.ПометкаУдаления
	|	И ВидыДокументовБИА.ИдентификаторПечатнойФормыПоУмолчанию = &ИдентификаторПечатнойФормыПоУмолчанию";
	ВидыДокументовБИА = Запрос.Выполнить().Выбрать();
	Если ВидыДокументовБИА.Количество() > 0 Тогда
		ВидыДокументовБИА.Следующий();
		НайденныйВид = ВидыДокументовБИА.Ссылка;
	КонецЕсли;
	
	Возврат НайденныйВид;
	
КонецФункции


#КонецОбласти

#КонецЕсли
